; ----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 2.0.0
; Author:	Pruthisith (Terry) <pruthisith@msn.com>
;
; Updating translations:
;   Before updating a translation, please make sure you have the current development version of
;   	Universal Extractor by enabling the 'Install beta updates' option in preferences and searching
;   	for updates by clicking 'Check for Updates' in the help menu.
; 	Make sure to read the messages titled 'Breaking changes' - which can be found at
;		https://github.com/Bioruebe/UniExtract2/issues/2 - for a list of changes to already translated
;   	terms. Please compare the affected translations with the always up-to-date English language file
;		and edit them to reflect the changes.
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file. Simply delete the Homepage line if you don't have one. Credit
;		yourself in the ABOUT_INFO_LABEL term if you want to.
;	Save the file in Unicode format (UTF-16/UCS-2 Little Endian) and send it to the developers -
;		via Github: https://github.com/Bioruebe/UniExtract2/issues/2 or
;		per e-mail to the address listed at https://bioruebe.com/contact/
;
;	The following symbols have special meanings:
;	& 		  - when used in a GUI label or button, it precedes the letter that will be registered
;				as a hotkey. Each letter should only be used once per menu.
;	%name	  - will be replaced with 'Universal Extractor'
;	%n	 	  - indicates a newline character
;	%t	  	  - indicates a tab character
;	%1,%2,... - indicates a string variable that UniExtract will replace
;		The content of each %1,... variable is hardcoded into UniExtract.
;		The numbered variables' order can be switched to fit your language's word order
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&ตกลง"
CANCEL_BUT = "&ยกเลิก"
YES_BUT = ""
NO_BUT = ""
DELETE_BUT = ""
COPY_BUT = ""
BATCH_BUT = ""
SEND_BUT = ""
NEXT_BUT = ""
PREV_BUT = ""
CLOSE_BUT = ""
EXIT_BUT = ""
CONTINUE_BUT = ""
FINISH_BUT = ""
ALWAYS_BUT = ""
NEVER_BUT = ""
CHECKBOX_REMEMBER = ""
CHECKBOX_DONT_ASK_AGAIN = ""
MAIN_DEST_DIR_LABEL = "&แฟ้มเป้าหมาย:"
MAIN_FILE_LABEL = "&ไฟล์บีบอัด/ตัวติดตั้งที่ต้องการแตก:"
MAIN_DIRECTORY_LOCK = ""
MAIN_DIRECTORY_LOCK_TOOLTIP = ""
MENU_FILE_LABEL = "&ไฟล์"
MENU_FILE_OPEN_LABEL = ""
MENU_FILE_KEEP_OPEN_LABEL = ""
MENU_FILE_SHOW_LABEL = ""
MENU_FILE_CLEAR_LABEL = ""
MENU_FILE_LOG_OPEN_LABEL = ""
MENU_FILE_LOG_FOLDER_OPEN_LABEL = ""
MENU_FILE_LOG_LABEL = ""
MENU_FILE_QUIT_LABEL = "&ออก"
MENU_EDIT_LABEL = "&แก้ไข"
MENU_EDIT_SILENT_MODE_LABEL = ""
MENU_EDIT_PASSWORD_LABEL = ""
MENU_EDIT_CONTEXT_LABEL = ""
MENU_EDIT_PREFS_LABEL = "&ปรับแต่งจัดการ"
MENU_HELP_LABEL = "&ช่วยเหลือ"
MENU_HELP_FEEDBACK_LABEL = ""
MENU_HELP_PLUGINS_LABEL = ""
MENU_HELP_UPDATE_LABEL = ""
MENU_HELP_WEB_LABEL = "%1 &เว็บไซท์"
MENU_HELP_GITHUB_LABEL = ""
MENU_HELP_STATS_LABEL = ""
MENU_HELP_PROGDIR_LABEL = ""
MENU_HELP_CONFIGFILE_LABEL = ""
MENU_HELP_ABOUT_LABEL = ""
PREFS_TITLE_LABEL = "ปรับแต่งจัดการ"
PREFS_UNIEXTRACT_OPTS_LABEL = "ตัวเลือก Universal Extractor"
PREFS_HISTORY_LABEL = "&ติดตามประวัติการบีบอัด"
PREFS_UPDATEINTERVAL_LABEL = ""
PREFS_UPDATE_DAILY = ""
PREFS_UPDATE_WEEKLY = ""
PREFS_UPDATE_MONTHLY = ""
PREFS_UPDATE_YEARLY = ""
PREFS_UPDATE_NEVER = ""
PREFS_UPDATE_CUSTOM = ""
PREFS_FORMAT_OPTS_LABEL = "ตัวเลือกรูปแบบ-เจาะจง"
PREFS_LANG_LABEL = "&ภาษา"
PREFS_WARN_EXECUTE_LABEL = "&เตือนก่อนที่ไฟล์จะทำงาน"
PREFS_WARN_EXECUTE_TOOLTIP = ""
PREFS_CHECK_FREE_SPACE_LABEL = ""
PREFS_CHECK_FREE_SPACE_TOOLTIP = ""
PREFS_CHECK_UNICODE_LABEL = ""
PREFS_CHECK_UNICODE_TOOLTIP = ""
PREFS_APPEND_EXT_LABEL = "&แก้ไขไฟล์ที่ไม่มีนามสกุล"
PREFS_APPEND_EXT_TOOLTIP = ""
PREFS_HIDE_TRAY_LABEL = ""
PREFS_HIDE_STATUS_LABEL = ""
PREFS_HIDE_STATUS_FULLSCREEN_LABEL = ""
PREFS_HIDE_STATUS_FULLSCREEN_TOOLTIP = ""
PREFS_OPEN_FOLDER_LABEL = ""
PREFS_FEEDBACK_PROMPT_LABEL = ""
PREFS_FEEDBACK_PROMPT_TOOLTIP = ""
PREFS_WINDOW_POSITION_LABEL = ""
PREFS_SEND_STATS_LABEL = ""
PREFS_SEND_STATS_TOOLTIP = ""
PREFS_LOG_LABEL = ""
PREFS_VIDEOTRACK_LABEL = ""
PREFS_VIDEOTRACK_TOOLTIP = ""
PREFS_TOPMOST_LABEL = ""
PREFS_BETA_UPDATES_LABEL = ""
PREFS_SOURCE_FILES_LABEL = ""
PREFS_SOURCE_FILES_OPT_ASK = ""
PREFS_SOURCE_FILES_OPT_DELETE = ""
PREFS_SOURCE_FILES_OPT_KEEP = ""
PREFS_SOURCE_FILES_OPT_KEEP_TOOLTIP = ""
PREFS_DELETE_ADDITIONAL_FILES_LABEL = ""
PREFS_DELETE_ADDITIONAL_FILES_TOOLTIP = ""
FEEDBACK_TITLE_LABEL = ""
FEEDBACK_SYSINFO_LABEL = ""
FEEDBACK_OUTPUT_LABEL = ""
FEEDBACK_MESSAGE_LABEL = ""
FEEDBACK_PRIVACY_ACCEPT_LABEL = ""
FEEDBACK_PRIVACY_VIEW_LABEL = ""
CONTEXT_ENTRIES_LABEL = ""
CONTEXT_ENABLED_LABEL = ""
CONTEXT_ALL_USERS_LABEL = ""
CONTEXT_ADMIN_REQUIRED = ""
CONTEXT_FILE_ASSOC_LABEL = ""
CONTEXT_SIMPLE_RADIO = ""
CONTEXT_CASCADING_RADIO = ""
CONTEXT_CASCADING_RADIO_TOOLTIP = ""
UPDATE_ACTION_INSTALL = ""
UPDATE_STATUS_SEARCHING = ""
UPDATE_TERM_PROGRAM_FILES = ""
UPDATE_WHATS_NEW = ""
FIRSTSTART_TITLE = ""
FIRSTSTART_PAGES = ""
FIRSTSTART_PAGE1 = ""
FIRSTSTART_PAGE2 = ""
FIRSTSTART_PAGE3 = ""
FFMPEG_LICENSE_ACCEPT_LABEL = ""
FFMPEG_LICENSE_VIEW_LABEL = ""
FFMPEG_SELECT_LABEL = ""
FFMPEG_SELECT_TITLE = ""
STATS_HEADER_STATUS = ""
STATS_HEADER_TYPE = ""
STATS_STATUS_SUCCESS = ""
STATS_STATUS_FAILED = ""
STATS_STATUS_FILEINFO = ""
STATS_STATUS_UNKNOWN = ""
STATS_NO_DATA = ""
FILESCAN_TITLE = ""
ABOUT_INFO_LABEL = "เวอร์ชันดั้งเดิมโดย %1%nเวอร์ชัน 2.0.0 โดย Bioruebe <%2>%nเวอร์ชัน %3 โดย gvp9000%n%nเผยแพร่ภายใต้ %4"
ABOUT_VERSION = ""
METHOD_ADMIN_RADIO = "การติดตั้งแบบผู้จัดการระบบ"
METHOD_EXTRACTION_RADIO = "การแตกไฟล์"
METHOD_HEADER = "แตกไฟล์ไปแล้ว %1"
METHOD_RADIO_LABEL = "วิธีการแตกไฟล์"
METHOD_SWITCH_RADIO = "เปลี่ยน"
METHOD_NOT_INSTALLER_RADIO = ""
METHOD_TEXT_LABEL = "%name รองรับการแตกไฟล์ตามด้านล่างนี้เพื่อการแตกแพ็คเกจของ %1 , แต่อย่างไรก็ตามวิธีแตกไฟล์เหล่านี้ไม่สามารถเชื่อได้ 100%, ถ้าหากว่าวิธีที่เลือกนั้นไม่สามารถทำงานได้ถูกต้องให้ทำการรัน %2 อีกครั้งแลัเลือกวิธีอื่น"
METHOD_UNPACKER_RADIO = "ตัวคลายแพ๊ค"
METHOD_GAME_LABEL = ""
METHOD_GAME_NOGAME = ""
METHOD_NOT_IN_LIST = ""
METHOD_FILE_SELECT_LABEL = ""
METHOD_EXTRACTOR_SELECT_LABEL = ""

; GUI control functions
EXTRACT_TO = "แตกไฟล์ไปยัง"
OPEN_FILE = "เปิดไฟล์"
SELECT_FILE = "เลือกไฟล์"
UPDATE_CURRENT = ""

; Common terms
TERM_ARCHIVE = "ไฟล์ต่างๆ"
TERM_AUDIO = ""
TERM_COMPILED = ""
TERM_COMPRESSED = "ไฟล์ที่ถูกบีบอัด"
TERM_CONTAINER = ""
TERM_DATABASE = ""
TERM_DISK_IMAGE = ""
TERM_DOWNLOAD = ""
TERM_DOWNLOADING = ""
TERM_EBOOK = "ebook"
TERM_ECARD = "ecard"
TERM_ENCODED = "ไฟล์ที่ถูก encode"
TERM_ENCRYPTED = ""
TERM_ERROR = ""
TERM_EXECUTABLE = ""
TERM_EXTRACT = ""
TERM_FILE = ""
TERM_GAME = ""
TERM_HELP = "ไฟล์ช่วยเหลือ"
TERM_HOTFIX = "ตัวแก้ไข"
TERM_IMAGE = "รูป"
TERM_INSTALLED = ""
TERM_INSTALLER = "ตัวติดตั้ง"
TERM_LOADING = ""
TERM_MERGE_MODULE = ""
TERM_OVERALL_PROGRESS = ""
TERM_PACKAGE = "แพ๊คเกจ"
TERM_PAGE = ""
TERM_PATCH = "patch"
TERM_RECONSTRUCTED = ""
TERM_SCAN = ""
TERM_SCRIPT = ""
TERM_SFX = "ตัวแตกไฟล์อัติโนมัติ"
TERM_STAGE = "ลำดับ"
TERM_TESTING = "กำลังทดสอบ"
TERM_TRANSLATION = ""
TERM_UNKNOWN = "ไม่ทราบ"
TERM_UNPACKED = "แตกออกแล้ว"
TERM_UPDATER = "อัปเดท"
TERM_VIDEO = ""

; Status messages
SCANNING_FILE = "กำลังตรวจสอบไฟล์เพื่อค้นหาชนิดของไฟล์"
SCANNING_EXE = "กำลังตรวจสอบไฟล์ด้วย %1 "
EXTRACTING = "กำลังแตกไฟล์จาก:"
INIT_WAIT = "กำลังรอตัวติดตั้งเพื่อทำการตรวจค่า%nโปรดรอ"
SENDING_FEEDBACK = ""
INPUT_NEEDED = ""
SEARCHING_PASSWORD = ""
TESTING_PASSWORD = ""
MOVING_FILE = ""
RENAMING_FILES = ""
RENAMING_FILES_PROGRESS = ""
PROCESSING = ""
CLEANING_UP = ""

; Custom prompts
INIT_COMPLETE = "กำลังเริ่มทำงาน %1.  โปรดออกจากตัวติดตั้ง, จากนั้นค่อยกด OK เพื่อทำต่อไป"
UNPACK_PROMPT = "ไฟล์นี้ได้ถูกแพ๊คด้วยการบีบอักแบบ %1 , แต่ไม่สามารถทำการแตกไฟล์ได้,%nนี่อาจจเป็นเพราะชนิดของไฟล์นั้นไม่ถูกรองรับ, หรีืออาจเป็นเพราะ%n"ไม่มีไฟล์ในการแตก.%n%nคุณต้องการจะคลายแพ๊คนี้แทนหรือไม่?%n%nแนะนำ: ไฟลืที่ถูกคลายออกนั้นจะถูกตั้งชื่อว่า:%n%2\%3_unpacked.%4"
UNPACK_FAILED = "เกิดข้อผิดพลาด: %1%nไม่สามารถคลายแพ๊คได้"
UNPACK_AGAIN = ""
NSIS_BINFILES = ""
WARN_EXECUTE = "คำเตือน:  ในการที่จะแตกไฟล์ประเภทนี้นั้น, ไฟล์จำเป็นที่จะต้องถูกเรียกทำงานโดยตรง,%nถ้าหากว่าคุณทำต่อไป, คำสั่งต่อไปนี้จะถูกทำงาน:%n%n%1%n%nถ้าหากคุณเชื่อว่าไฟล์นี้อาจเป็นไฟล์อันตราย, เราจะขอแนะนำให้คุณไม่ทำการต่อไป,%nคุณต้องการจะทำต่อไปกับการแตกไฟล์นี้หรือไม่?"
FEEDBACK_SUCCESS = ""
FEEDBACK_PROMPT = ""
FEEDBACK_PRIVACY = ""
FEEDBACK_OUTDATED = ""
FFMPEG_NEEDED = ""
PROGRAM_FILES_MISSING = ""
PLUGIN_MISSING = ""
UPDATE_PROMPT = ""
FILE_COPY = ""
FILE_DELETE = ""
BATCH_DUPLICATE = ""
NO_FREE_SPACE = ""
CONTEXT_DANGEROUS = ""
ELEVATION_REQUIRED = ""
ACCESS_DENIED = ""
MOVE_FAILED = ""

; Help text
HELP_TITLE = ""
HELP_USAGE_TITLE = ""
HELP_USAGE = ""
HELP_ARGUMENTS = "%n%nตัวแปรที่รองรับ:"
HELP_SCAN = ""
HELP_FILENAME = "%n     filename%tชื่อของไฟลืที่จะทำการแตก"
HELP_DESTINATION = "%n     destination%tแฟ้มที่ต้องการจะให้แตกไฟล์"
HELP_SILENT = ""
HELP_BATCH = ""
HELP_TYPE = ""
HELP_SUB = "%n%nการใ้ช้ /sub แทนชื่อแฟ้มเป้าหมายจะเป็นการสั่ง%n%name เพื่อทำการแตกไฟล์ไปยัง subdirectory ที่ถูกตั้งไว้หลังจากไฟลืบีบอัีด"
HELP_LAST = ""
HELP_NOARGS = "%n%nทำงานโดย %name ไม่มีตัวแปรใดๆจะทำให้เกิด%nการแสดงหน้าจอถามผู้ใช้ ชื่อไฟล์ และ แฟ้มเป้าหมาย"
HELP_MORE = ""
HELP_EXAMPLE_TITLE = ""
HELP_EXAMPLE = ""
HELP_DOCS_LINK = ""

; Warning messages
WARN_CONVERSION_FAILED = ""
WARN_MOVE_FAILED = ""

; Error messages
UNKNOWN_FILETYPE_TITLE = ""
UNKNOWN_FILETYPE = ""
INVALID_FILE = ""
INVALID_DIR = "%1%nไม่สามารถสร้างไฟล์ได้, โปรดเลือกแฟ้มเป้าหมายที่ถูกต้อง"
NO_HISTORY = ""
EXTRACT_FAILED = "%name ไม่สามารถแตกไฟล์ได้%nดูเหมือนว่ามันจะเป็น %1, ซึ่งถูกรองรับ, แต่มรการผิดพลาดในการแตกไฟล์%nโปรดดูไฟล์บันทึก, %2, สำหรับข้อมูลเพื่อเติม%n%nกด ตกลง เพื่อแสดงไฟล์บันทึกเดี๋ยวนี้, หรือ ยกเลิก เพื่อออกจากโปรแกรม"
NOT_PACKED = ""
DOWNLOAD_FAILED = ""
UPDATECHECK_FAILED = ""
UPDATE_FAILED = ""
UPDATE_NOADMIN = ""
FFMPEG_MOVE_FAILED = ""
FFMPEG_INVALID_FILE = ""
FEEDBACK_EMPTY = ""
FEEDBACK_ERROR = ""
FEEDBACK_PRIVACY_NOT_ACCETPED = ""
LICENSE_NOT_ACCEPTED = ""
BATCH_FINISH = ""
NOT_SUPPORTED_TITLE = ""
NOT_SUPPORTED = ""
MISSING_EXE = ""
EXTRACT_TIMEOUT = ""
WRONG_PASSWORD = ""
NO_FREE_SPACE_ERROR = ""
MISSING_PART = ""
PLUGIN_IMPORT_MISSINGFILES = ""
MISSING_DEFINITION = ""
OPEN_URL_FAILED = ""

; Plugin descriptions
PLUGIN_SUPPORTED_FILETYPES = ""
PLUGIN_ARC_CONV = ""
PLUGIN_ISCAB = ""
PLUGIN_THINSTALL = ""
PLUGIN_UNREAL = ""
PLUGIN_WINTERMUTE = ""
PLUGIN_CI = ""
PLUGIN_DGCA = ""
PLUGIN_BOOTIMG = ""
PLUGIN_IS5COMP = ""
PLUGIN_WOLF = ""
PLUGIN_EXTSIS = ""
PLUGIN_BITROCK = ""

; Context Menu integration
EXTRACT_FILES = "UniExtract &ไฟล์..."
EXTRACT_HERE = "UniExtract &ที่นี่"
EXTRACT_SUB = "UniExtract ไปยังแ&ฟ้ม"
EXTRACT_LAST = ""
SCAN_FILE = ""

; Other
DIR_ADDITIONAL_FILES = ""

; Uninstaller
UNINSTALL = ""
UNINSTALL_TITLE = ""
UNINSTALL_LABEL = ""
UNINSTALL_REMOVE_LOGS = ""
UNINSTALL_REMOVE_USERDATA = ""
